Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: The client generates a random integer, K, in the range 0 <= K < 2^(KLEN-2*HLEN-49), where KLEN is the length of the modulus of K_T, in bits.
ja: クライアントは乱数 K を生成する. K は以下の範囲の数だ: 0 <= K < 2^(KLEN-2*HLEN-49). KLEN は K_Tのモジュラスのビットでの長さだ.

source: The registry maps each header-tag to a reference defining the header.
ja: このレジストリは, それぞれの header-tag を ヘッダを定義しているリファレンスにマップしている.

source: An example of a validation algorithm can be found in Section 3.2.2 of [SEC1].
ja: 検証アルゴリズムの例は, [SEC1]の 3.2.1節にある.

source: The lower of the version numbers is the version of the protocol to use.
ja: 低いほうのバージョン番号が, 利用されるプロトコルのバージョンとなる.

source: If the authentication succeeds and a non-empty user name is presented by the client, the SSH server implementation verifies that the user name is authorized based on the credentials exchanged in the GSS-API exchange.
ja: 認証が成功され空でないユーザ名がクライアントから提示されたら， SSHのサーバ実装は， GSS-API交換で交換した認証情報に基づいてユーザ名が認可されるか確認する．

source: This message is used to transmit information that may help debugging.
ja: このメッセージは, デバッグを助ける情報を転送するのに使われる.

source: The comment header contains a user-specified comment.
ja: comment ヘッダは, ユーザが指定したコメントを含む.

source: The server lists the algorithms for which it has host keys; the client lists the algorithms that it is willing to accept.
ja: サーバは, 保有するホスト鍵のアルゴリズムを挙げる. クライアントは, 受け入れられるアルゴリズムのリストを挙げる.

source: Initially, the server is responsible for flow control.
ja: まず, サーバがフロー制御の責任を持つ.

source: The "arcfour128" algorithm is the RC4 cipher, as described in [SCHNEIER], using a 128-bit key.
ja: "arcfour128" アルゴリズムは [SCHNEIER] で記述されている RC4 暗号で, 128-bit鍵を利用する.

source: Secure Shell Binary Packets
ja: セキュアシェルのバイナリパケット

source: Host Keys
ja: ホスト鍵

source: Multiple SNMP messages MAY be passed through the same channel.
ja: 複数の SNMP メッセージが同じチャンネルを通して送られてもよい.

source: X11 Channels
ja: X11 のチャンネル

source: This document describes a general purpose authentication method for the SSH protocol, suitable for interactive authentications where the authentication data should be entered via a keyboard (or equivalent alphanumeric input device).
ja: この文書は, SSHプロトコルのための汎用の認証法を記述している. この認証法は, 認証データをキーボード(や同様の英数入力デバイス)で入力する状況でインタラクティブな認証を行なうのに適している.

source: The protocol was not designed to eliminate covert channels.
ja: プロトコルは, コバートチャンネルを除去するようには設計されてない.

source: In any case, if the 'user name' does not exist, the authentication request MUST NOT be accepted.
ja: どちらにせよ, 'user_name' が存在しないなら, 認証を受け入れてはならない.

source: In the case that the server sends a `0' num-prompts field in the request message, the client MUST send a response message with a `0' num-responses field to complete the exchange.
ja: サーバが 要求メッセージで `0' な num-prompts フィールドを送った場合, クライアントは, 交換を完了するために '0' な num-responses フィールドで 応答メッセージを送らなければならない.

source: If both hold, the authentication request MUST be accepted; otherwise, it MUST be rejected.
ja: 以上の両方が成立したら, 認証の要求は受け入れられなければならない. さもなければ, 拒否されなければならない.

source: Other GSS-API Key Exchange Methods ........................12 3.
ja: その他の GSS-API 鍵交換法 ........................12 3.

source: If end-point security has been compromised, X11 forwarding may allow attacks against the X11 server.
ja: エンドポイントのセキュリティが侵害されていると, X11 転送はX11サーバへの攻撃を許してしまう.

source: o Encryption key client to server: HASH(K || H || "C" || session_id)
ja: o クライアントからサーバへの暗号鍵: HASH(K || H || "C" || session_id)

source: Additional methods may be defined as specified in [SSH-ARCH] and [SSH-NUMBERS].
ja: 追加の方法が, [SSH-ARCH] や [SSH-NUMBERS] で定義されるかもしれない.

source: Conceptual Differences between USM and SSHTM ..............31 9.5.
ja: USM と SSHTM の概念的な違い ..............31 9.5.

source: Each key exchange method specifies a hash function that is used in the key exchange.
ja: それぞれの鍵交換法は, 鍵交換で使うハッシュ関数を指定している.

source: The primitive used for shared key generation is ECDH with cofactor multiplication, the full specification of which can be found in Section 3.3.2 of [SEC1].
ja: 共有鍵の生成に使われる primitive は, 余因子の乗算(cofactor multiplication)を用いる ECDHだ. 完全な仕様は, [SEC1}の 3.3.2 節にある.

source: The following attributes are currently defined:
ja: 現在次の属性が定義されている:

source: It requires a signature-capable host key.
ja: この方法には, 署名ができるホスト鍵が必要だ.

source: The client SHOULD attempt to use this method if it is advertised by the server, initial key exchange was performed using a GSS-API-based key exchange method, and this method has not already been tried.
ja: サーバからのこの認証法が告示され, 最初の鍵交換がGSS-APIベースの鍵交換法を用いて行なわれ, この認証法を試していない場合, クライアントは, この認証を試す必要がある.

source: Operational Considerations
ja: 運用上の考察

source: Establishing a Session ....................................18 5.4.
ja: セッションの確立 ....................................18 5.4.

source: If the server does not support any of the specified OIDs, the server MUST fail the request by sending an SSH_MSG_USERAUTH_FAILURE packet.
ja: サーバが指定された OID をどれもサポートしていなければ， SSH_MSG_USERAUTH_FAILURE パケットを送信してサーバは要求を失敗させなければならない．

source: All authentication related messages received after sending this message SHOULD be silently ignored.
ja: このメッセージが送信されたあとで受け取るすべての認証関係のメッセージは, 静かに無視される必要がある.

source: Servers SHOULD be configurable to allow access to the SNMP SSH Subsystem over other ports.
ja: サーバは, 他のポート上の SNMP SSH サブシステムへのアクセス許可を設定可能にする必要がある.

source: TCP/IP Forwarding Channels
ja: TCP/IP転送チャンネル

source: The following table identifies the initial assignments of the Authentication Method Names.
ja: 次の表で, 認証法の名前の初期の割り当てを示す.

source: The document containing the <hello> element is the first XML document that the NETCONF client sends after the NETCONF session is established.
ja: <hello> 要素を含む文書は, NETCONF セッションが確立したあとに NETCONF クライアントが送る最初の XML 文書でなければならない.

source: [RFC4253] requires that the formation of the AT involve the packet sequence_number, a 32-bit value that counts the number of binary packets that have been sent on a given SSH tunnel.
ja: [RFC4253] は, ATの形成に パケットの sequence_number, SSH トンネルで送られたバイナリパケットの数を数える32-ビットの値, を含むことを要求している.

source: The name and instruction fields MAY be empty strings; the client MUST be prepared to handle this correctly.
ja: name や instruction フィールドは空の文字列でもよい. クライアントはこれらを正しく処理するよう準備されなければならない.

source: Channel Connection Failure 'reason code' values in that range are left for PRIVATE USE, as described in [RFC2434].
ja: この範囲のチャンネル接続失敗の 'reason code'の値は, [RFC2434]に記述されている プライベートな利用 (PRIVATE USE) に予約されている.

source: Please see [BKN1,BKN2] for details.
ja: 詳細は [BKN1,BKN2] を参照せよ.

source: Straight bit-wise, binary comparison is RECOMMENDED.
ja: ストレートなビット単位のバイナリの比較が推奨される.

source: The server host key is used during key exchange to verify that the client is really talking to the correct server.
ja: 鍵交換の際にクライアントが本当に正しいサーバと通信しているかを検証するために, サーバのホスト鍵は使われる.

source: The client actively opens the SSH connection, and the server passively listens for the incoming SSH connection.
ja: クライアントが能動的にSSHの接続を開き, サーバは受動的にSSHの接続を待ち受ける.

source: Unlike the other public key formats specified in this document, the x509v3-rsa2048-sha256 public key format does not correspond to any previously existing SSH non-certificate public key format.
ja: この文書で指定されている他の公開鍵形式と異なり, x509v3-rsa2048-sha256 公開鍵形式は, 既存の SSH 非証明書公開鍵形式と対応しない.

source: Let L be the block length (in bits) of an SSH encryption method's block cipher (e.g., 128 for AES).
ja: L をSSHの暗号法でのブロック暗号の(ビットでの)ブロック長とする (例えばAESでは128).

source: The recipient should respond with SSH_MSG_CHANNEL_OPEN_CONFIRMATION or SSH_MSG_CHANNEL_OPEN_FAILURE.
ja: 受け取り手は, SSH_MSG_CHANNEL_OPEN_CONFIRMATION か SSH_MSG_CHANNEL_OPEN_FAILURE で応答しなければならない.

source: If message authentication has been negotiated, this field contains the MAC bytes.
ja: メッセージ認証コードが取り決められていたら, このフィールドはMACを含む.

source: GCM uses counter mode to encrypt the data, an operation that can be efficiently pipelined.
ja: GCM は, データを暗号化するのカウンタモードを利用する. これは効率的にパイプライン化できる操作だ.

source: The num-prompts field may be `0', in which case there will be no prompt/echo fields in the message, but the client SHOULD still display the name and instruction fields (as described below).
ja: num-prompts フィールドは メッセージで prompt/echo フィールドが存在しない場合に `0' の場合もある. (後述するように)その場合もクライアントは name と instruction フィールドを表示する必要がある.

source: o The non-signature algorithms MUST all come from Family 2.
ja: o 署名以外のアルゴリズムは, すべて Family 2 から取得しなければならない.

source: The worst case is 3 round-trips.
ja: 最悪の場合は3回の往復が必要となる.

source: If no authentication is needed for the user, the server MUST return SSH_MSG_USERAUTH_SUCCESS.
ja: ユーザに認証が必要なければ, サーバは, SSH_MSG_USERAUTH_SUCCESS を返さなければらなない.

source: Sending a proper disconnect message is RECOMMENDED.
ja: 正当な切断メッセージを送ることが推奨される.

source: The following rules apply:
ja: 以下の規則が適用される:

source: The requirements on the size of K are intended to ensure that it is always possible to encrypt it under K_T.
ja: Kのサイズへの必要条件は, K_Tで常に暗号化できることが保証されていることだ.

source: GSS-API Considerations
ja: GSS-API の考察

source: The authentication protocol assumes that the underlying protocols provide integrity and confidentiality protection.
ja: 認証プロトコルは, その下層のプロトコルが完全性と機密性を提供することを前提とする.

source: The instructions for the IANA for the SSH protocol, as defined in this document, [SSH-USERAUTH], [SSH-TRANS], and [SSH-CONNECT], are detailed in [SSH-NUMBERS].
ja: この文書, [SSH-USERAUTH], [SSH-TRANS], [SSH-CONNECT] で定義される SSH プロトコルに対する IANA への 指示は, [SSH-NUMBERS] で詳述されている.

source: The server SHOULD attempt to store each comment with its language attribute.
ja: サーバは, その言語属性付きでコメントを保存するように試みる必要がある.

source: It is however believed that the associated threat is not very high.
ja: しかし, 関連する脅威は非常に高くはないと信じられている.

source: 41 IMAXBEL Ring bell on input queue full.
ja: 41 IMAXBEL 入力キューがいっぱいのときにベルを鳴らす.

source: This identification string does not contain the optional 'comments' string and is thus terminated by a CR and LF immediately after the 'softwareversion' string.
ja: この識別文字列は, 選択可能な 'comments'を含んでいない. そのため, 'softwareversion' の直後に CR と LFで終端されている.

source: The SHA2 family consists of four variants -- SHA-224, SHA-256, SHA-384, and SHA-521 -- named after their digest lengths.
ja: SHA2 ファミリは4つのバリエーションで構成されている. SHA-224 と SHA-256, SHA-384, SHA-521 だ. そのダイジェストの長さによって命名された.

source: In that case, US-ASCII is used for internal names, and ISO-10646 UTF-8 for text that might be displayed to the user.
ja: この時, 内部の名前には US-ASCIIが利用される. また, ISO-10646 UTF-8 がユーザに表示される可能性のあるテキストとして利用される.

source: Implementations are expected to have some limit on the SSH transport layer packet size (any limit for received packets MUST be 32768 bytes or larger, as described in [SSH-TRANS]).
ja: 実装には, SSH トランスポート層の packet size に制限があることを期待される (packet の受信のためのどのような制限も, [SSH-TRANS]に記述されているように, 32768 byte 以上でなければならない.).

source: Public Key Subsystem Attribute Names
ja: 公開鍵サブシステムの属性名

source: Secure shell (SSH) is a secure remote-login protocol.
ja: セキュア シェル(SSH) は 安全なロモートログインプロトコルだ.

source: The <hello> message MUST be followed by the character sequence ]]>]]>.
ja: <hello> メッセージは, 文字列 ]]>]]> が後に続かなければならない.

source: A GUI client might like to have a checkbox toggling echo/mask.
ja: GUI クライアントは, echo/maskのトグルを行なうチェックボックスを付けてもよい.

source: o Public key algorithms and key exchange method to be used for host authentication.
ja: o ホスト認証で利用される公開鍵アルゴリズムと鍵交換法

source: If the client wishes to add a public key, the client sends:
ja: クライアントが公開鍵を追加したい場合, クライアントは以下を送る:

source: Server implementations MAY support a configurable compatibility flag that enables compatibility with old versions.
ja: サーバの実装は, 古いバージョンとの互換性を有効にする互換性についての設定フラグをサポートしてもよい.

source: The 'host to connect' may be either a domain name or a numeric IP address.
ja: 'host to connect' は ドメイン名か数値のIPアドレスだ.

source: which case, the administrators will have to actively make changes to the initial default parameters to meet their needs.
ja: 後者の場合, 管理者は要件に添うようにデフォルトのパラメータを能動的に変更しなければならないだろう.

source: It provides interactive login sessions, remote execution of commands, forwarded TCP/IP connections, and forwarded X11 connections.
ja: このプロトコルは, インタラクティブなログインセッション, コマンドのリモート実行, TCP/IP接続の転送, X11接続の転送を提供する.

source: Examples ...................................................5 4.
ja: 例 ...................................................5 4.

source: ECDH Key Exchange Method Names (ecdh-sha2-*) ..............12 6.4.
ja: ECDH 鍵公開法の名前 (ecdh-sha2-*) ..............12 6.4.

source: Figure 4: Structure of an AES Input for SSH AES-GCM
ja: 図 4: SSH AES-GCM への AES の入力の構造

source: This allows the SNMP Access Control Subsystem to ensure that only authorized principals have access to potentially sensitive data.
ja: これにより, 認証されたもののみが機密の可能性のあるデータへのアクセスをすることを SNMP アクセス制御サブシステムが保証できる.

source: This makes exploiting compromised host keys more difficult.
ja: これは, 不正なホスト鍵を利用した攻撃をより難しくする.

source: The use of a MAC other than "none" provides integrity and authentication.
ja: "none" 以外のMACは, 完全性と認証を提供する.

source: Requests for assignments of new message numbers in the range of 128 to 191 MUST be done through the IETF CONSENSUS method, as described in [RFC2434].
ja: 128から191の範囲に新たなメッセージ番号を割り当てる要求は, [RFC2434] に記述されている IETF CONSENSUS によってされなければならない.

source: The data types "byte", "string", and "mpint" are defined in Section 5 of [RFC4251].
ja: データ型 byte, string, mpint は, [RFC4251] で記述されているように解釈される.

source: Implementations that literally interpret the BREAK length parameter without imposing the suggested BREAK time limit may cause a denial of service to or unexpected results from attached devices receiving the very long BREAK signal.
ja: 示唆した BREAK時間の制限を行なわなず BREAK length パラメータのまま解釈する実装は, 非常に長い BREAK 信号を受けて , 接続したデバイスからサービス不能や予期しない結果になるかもしれない.

source: If at any time during the exchange the client sends a new SSH_MSG_USERAUTH_REQUEST packet, the GSS-API context is completely discarded and destroyed, and any further GSS-API authentication MUST restart from the beginning.
ja: 交換中いつでもクライアントは新しい SSH_MSG_USERAUTH_REQUEST パケットを送れる． このとき GSS-API コンテキストは完全に破棄され破壊される． 次のGSS-API認証は最初から始められなければならない．

source: This is all the more true when specifying larger hash function outputs and DH parameters.
ja: より大きなハッシュ関数の出力はDHのパラメータを定義した場合には, これはより確かになる.

source: For example:
ja: 例:

source: Key Exchange ...............................................4 5.2.
ja: 鍵交換 ...............................................4 5.2.

source: Secure Shell Transport Model Cached Information ...........13 4.1.1.
ja: セキュアシェルトランスポートモデルのキャッシュされる情報 ...........13 4.1.1.

source: Authentication is complete when the server has responded with SSH_MSG_USERAUTH_SUCCESS.
ja: サーバが, SSH_MSG_USERAUTH_SUCCESS を返すと, 認証は完了する.

source: tmSecurityName = the derived tmSecurityName from step 3.
ja: tmSecurityName = ステップ 3 から導出された tmSecurityName

source: Listing Public Keys .
ja: 公開鍵の一覧の取得 .

source: SSH User and Key Selection ................................31
ja: SSH のユーザと鍵の選択 ................................31

source: Data transfer is done with messages of the following type.
ja: データの転送は次の種類のメッセージで行なわれる.

source: o if any of the other algorithms cannot be agreed upon (the procedure is defined below in Section 7.1).
ja: o どのアルゴリズムでの同意できなかった(この同意の手順は 7.1 節で後述する).

source: Some sites wish to allow authentication based on the host that the user is coming from and the user name on the remote host.
ja: ユーザがやってくるホストとリモートホストでのユーザ名をベースにした認証を行ないたいサイトもある.

source: More application data may be sent after the SSH_MSG_NEWKEYS packet has been sent; key exchange does not affect the protocols that lie above the SSH transport layer.
ja: SSH_MSG_NEWKEYS が送られた後で, さらなるアプリケーションのデータが送られるだろう; 鍵交換はSSHトランスポート層の上位のプロトコルには影響しない.

source: 9) At minLOS_192, each SecSh-B server and each SecSh-B user MUST have an ECDSA-384 signing key with a corresponding X.509v3 certificate.
ja: 9) minLOS_192 の場合, それぞれの SecSh-B サーバとそれぞれの SecSh-B ユーザは,対応する X.509v3 証明書で ECDSA-384 鍵を持たなければならない.

source: Key Exchange Methods ......................................13 6.6.
ja: 鍵交換法.....................................13 6.6.

source: Initially, compression MUST be "none".
ja: 最初は, 圧縮は "none" でなければならない.

source: Otherwise, the old end-of- message-based mechanism (see Section 4.3) is used.
ja: そうでなければ, 古いメッセージ終了ベースのメカニズム (4.3 節参照) が用いられる.

source: Chunked Framing Mechanism .
ja: チャンクされたフレーミングメカニズム .

source: The values of 'request type' are local to each channel type.
ja: 'request type' の値は それぞれの channel type に局所的だ.

source: Administrators of host machines should make all attempts to compartmentalize all event notification messages and protect them from unwarranted observation.
ja: ホストの管理者は, すべてのイベント通知メッセージを区分けしメッセージを不当な監視から守るためにあらゆる試みを行なうべきだ.

source: Subsystem support is a feature of SSH version 2 (SSHv2) and is not included in SSHv1.
ja: サブシステムのサポートは,SSH バージョン 2 (SSHV2) の機能で, SSHv1 には含まれていない.

source: MIB Module Overview
ja: MIB モジュールの概要

source: When the server accepts authentication, it MUST respond with the following:
ja: サーバが認証を受け入れる場合, 次のメッセージで返答しなければならない;

source: When the agent processes a <close-session> command, the agent shall respond and close the SSH session channel.
ja: エージェントが <close-session> コマンドを処理する場合は, エージェントは応答し SSH のセッションチャンネルを終了する必要がある.

source: Elliptic Curve Domain Parameter Identifiers
ja: 楕円曲線ドメインパラメータ識別子

source: Taking Keys Into Use
ja: 鍵の利用

source: This section serves to strengthen the suggestion in [RFC4253] by giving firm upper bounds on the tolerable number of encryptions between rekeying operations.
ja: この節では, 鍵の再生成の間に許容できる暗号化の回数の上限をしっかりと与えることによって, [RFC4253]の示唆を強化する.

source: It is a comma-separated list of authentication submethods (software or hardware) that the user prefers.
ja: ユーザが好む認証 submethod (ソフトウェアないしハードウェア)のコンマ区切りリストだ.

source: If this message is received by the server when the negotiated GSS-API context does not support per-message integrity protection, the server MUST fail the authentication.
ja: 交渉済みの GSS-API コンテキストが メッセージ単位の完全性保護をサポートしていない場合にこのメッセージをサーバが受け取ったら, サーバは認証を失敗させなければならない.

source: The exchange hash H is computed as the hash of the concatenation of the following.
ja: 交換ハッシュ H は, 以下の連結のハッシュで計算される.

source: ECMQV Key Exchange and Verification Method Name (ecmqv-sha2)
ja: ECMQV 鍵交換/検証法の名前 (ecmqv-sha2)

source: -- The snmpSshtmSession Group
ja: -- snmpSshtmSession グループ

source: Servers SHOULD be configurable to allow access to the netconf SSH subsystem over other ports.
ja: サーバは, 他のポート上の netconf SSH サブシステムへのアクセス許可を設定可能にする必要がある.

source: SSH_MSG_KEXINIT C->S Contains lists of algorithms acceptable to the client.
ja: SSH_MSG_KEXINIT C->S クライアントが受け入れられるアルゴリズムのリストを含む.

source: The input to the algorithm is the public key data as specified by [RFC4253].
ja: アルゴリズムへの入力は, [RFC4253] で指定された公開鍵データだ.

source: 129 TTY_OP_OSPEED Specifies the output baud rate in bits per second.
ja: 129 TTY_OP_OSPEED bit/秒単位で出力バンドレートを指定する.

source: When this message is received, a party MUST respond with its own SSH_MSG_KEXINIT message, except when the received SSH_MSG_KEXINIT already was a reply.
ja: このメッセージを受信したら, 受け取った側は自身の SSH_MSG_KEXINIT メッセージを送らなければならない. ただし, 受け取った SSH_MSG_KEXINIT が返信の場合は除く.

source: The subsystem name used with this protocol is "publickey".
ja: このプロトコルで用いられるサブシステム名は "publickey" だ.

source: The following message numbers are defined:
ja: 以下のメッセージ番号が定義されている:

source: Additional authentication mechanisms, such as one that supports X.509 certificates, may be added to SSH in the future.
ja: X.509 証明書をサポートするものなど, 追加の認証メカニズムが将来SSHに追加されることがある.

source: There are three cases of man-in-the-middle attacks to consider.
ja: 考慮すべき中間者攻撃のケースは, 3つある.

source: First, the client sends the following:
ja: まず, クライアントは次のメッセージを送る.

source: However, this property is not commuted to any of the applications or protocols using SSH as a transport.
ja: しかし, この性質は, トランスポートとしてSSHを用いるアプリケーションやプロトコルのどれも変化させない.

source: An example of use of the "compulsory" attribute would be a server with a configuration file specifying that the user is not permitted shell access.
ja: "compulsory" 属性の利用の例として, ユーザのシェルアクセスを拒否する指定が設定ファイルにあるサーバを挙げる.

source: The following policy issues SHOULD be addressed in the configuration mechanisms of each implementation:
ja: 次のポリシーの問題を, それぞれの実装の設定メカニズムで扱う必要がある.

source: o The self-signed certificate specifying the root authority MAY be omitted.
ja: o ルート認証局を指定する自己署名証明書は, 省略してもよい.

source: Version 3 of the Simple Network Management Protocol (SNMPv3) added security to the protocol.
ja: シンプルネットワークマネジメントプロトコルのバージョン3 (SNMPv3) はプロトコルにセキュリティを追加した.

source: After receiving the response, the server MUST send either an SSH_MSG_USERAUTH_SUCCESS, SSH_MSG_USERAUTH_FAILURE, or another SSH_MSG_USERAUTH_INFO_REQUEST message.
ja: 応答を受け取ったら, サーバは, SSH_MSG_USERAUTH_SUCCESS か, SSH_MSG_USERAUTH_FAILURE, さらにもう1つの SSH_MSG_USERAUTH_INFO_REQUEST メッセージで応答しなければならない.

source: Security Considerations .........................................5 5.
ja: セキュリティの考察 .........................................5 5.

source: The server's policy MAY require multiple authentication for some or all users.
ja: サーバのポリシーは, 何人かないしすべてのユーザに対して複数の認証を必要としてもよい.

source: The comment SHOULD be displayed when using the key.
ja: このコメントは, 鍵の利用時に表示される必要がある.

source: For all other elliptic curves, including all other NIST curves and all other RECOMMENDED curves, the elliptic curve domain parameter identifier is the ASCII period-separated decimal representation of the Abstract Syntax Notation One (ASN.1) [ASN1] Object Identifier (OID) of the named curve domain parameters that are associated with the server's ECC host keys.
ja: 他のすべてのNISTの曲線と他のすべての推奨される曲線を含む他のすべての楕円曲線のために, 楕円曲線ドメインパラメータ識別子は, サーバの楕円曲線ホスト鍵に関連付いて指定された曲線ドメインパラメータのASN.1[ASN1]オブジェクト識別子(OID)のASCIIでピリオドで分割された10進表現で表現される.

source: Otherwise, this flag MAY be set to true if the client wishes to hide its identity.
ja: もしくは, クライアントがそのアイデンティティを隠そうとする場合にこのフラグを true に設定してもよい.

source: PFS is essentially defined as the cryptographic property of a key-establishment protocol in which the compromise of a session key or long-term private key after a given session does not cause the compromise of any earlier session [ANSI-T1.523-2001].
ja: PFS は, 鍵確立プロトコルの暗号学的な性質として本来定義される. 鍵確立プロトコルにおいて, あるセッションでセッション鍵ないし長期間の秘密鍵が漏れても, それより前のセッションの情報は危険とならないという性質だ. [ANSI-T1.523-2001].

source: Additional Messages ...........................................25 11.1.
ja: 追加のメッセージ......................................25 11.1.

source: When a call results in a major_status code of GSS_S_COMPLETE, it sends one of two final messages.
ja: 呼び出しで major_status コードが GSS_S_COMPLETE となったなら, 2つの最終メッセージのうちの1つをサーバは送る.

source: However, if you do this, then an attacker may be able to modify the data in flight, which means you effectively have no authentication.
ja: しかし, これを利用すると, 攻撃者が通信データを変更できる. これは, 実質的に認証がないことを意味する.

source: It is up to the server how it interprets the user name and determines whether the client is authorized based on his GSS-API credentials.
ja: ユーザ名がどう解釈されGSS-APIの認証情報に基づいてクライアントが認可されるかどう決定するかは， サーバ次第だ．

source: The meanings of message numbers in the range of 30 to 49 are specific to the key exchange method in use, and their meaning will be specified by the definition of that method.
ja: 30から49の範囲のメッセージ番号は, 利用する鍵交換法に特有だ. その意味は方法の定義で決まる.

source: Table 3 lists three allowable name lists for the server host key algorithms.
ja: 表 3 は, サーバホスト鍵アルゴリズムの3つの受け入れられる name-list を示す.

source: string Q_S // the server's ephemeral contribution to the // ECDH exchange, encoded as an octet string
ja: string Q_S // ECDH 交換に対するサーバの一時 contribution. オクテット文字列としてエンコードされる

source: For example, if an implementation wants to send a very large number of certificates, the larger packets MAY be sent if the identification string indicates that the other party is able to process them.
ja: 例えば, ある実装が非常にたくさんの数の証明書を送りたい場合, 識別文字列によって相手側もそのような証明書群の処理ができることが示されているならば, より大きなパケットが送られてもよい.

source: Otherwise, the server MUST return SSH_MSG_USERAUTH_FAILURE and MAY return with it a list of methods that may continue in its 'authentications that can continue' value.
ja: さもなければ, サーバは, SSH_MSG_USERAUTH_FAILURE を返さなければならない. また, サーバは, 認証を続行する 'authentications that can continue' の値のリストに "none" を含めてもよい.
